import React from 'react'
import './Header.css'

const Header = () => {
  return (
    <div className="navb" >
      <div className='container'>
        <ul>
            <li><a href='#'><svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M12.7916 9.51237C12.7828 8.03695 13.4592 6.92497 14.825 6.10505C14.0611 5.02336 12.9054 4.42843 11.382 4.31377C9.93953 4.20128 8.36137 5.14451 7.78352 5.14451C7.17283 5.14451 5.77635 4.35272 4.67755 4.35272C2.40991 4.38733 0 6.13966 0 9.70491C0 10.7585 0.194807 11.8467 0.584421 12.9673C1.10536 14.4427 2.98339 18.0577 4.9424 17.9993C5.96678 17.9755 6.69129 17.2811 8.02429 17.2811C9.3179 17.2811 9.98768 17.9993 11.1303 17.9993C13.1068 17.9712 14.8053 14.685 15.3 13.2053C12.6493 11.97 12.7916 9.58809 12.7916 9.51237ZM10.4911 2.91407C11.6009 1.61172 11.5002 0.426185 11.4673 0C10.4867 0.0562478 9.35292 0.65983 8.70721 1.40187C7.99584 2.19799 7.57777 3.18233 7.66751 4.29214C8.72691 4.37219 9.69438 3.8335 10.4911 2.91407Z" fill="white"/>
</svg></a></li>
            <li><a href='#'>Store</a></li>
            <li><a href='#'>Mac</a></li>
            <li><a href='#'>iPad</a></li>
            <li><a href='#'>iPhone</a></li>
            <li><a href='#'>Watch</a></li>
            <li><a href='#'>AirPods</a></li>
            <li><a href='#'>TV n Home</a></li>
            <li><a href='#'>Only On Apple</a></li>
            <li><a href='#'>Accessories</a></li>
            <li><a href='#'>Support</a></li>
            <li><a href='#'><svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M8.3913 8.3913L11 11" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
<path d="M5.13043 9.26087C7.41161 9.26087 9.26087 7.41161 9.26087 5.13043C9.26087 2.84926 7.41161 1 5.13043 1C2.84926 1 1 2.84926 1 5.13043C1 7.41161 2.84926 9.26087 5.13043 9.26087Z" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
</svg>
</a></li>
            <li><a href='#'><svg width="11" height="12" viewBox="0 0 11 12" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M3.30769 4.07692V3.30769C3.30769 2.69565 3.55082 2.10868 3.9836 1.67591C4.41638 1.24313 5.00335 1 5.61538 1V1C6.22742 1 6.81439 1.24313 7.24717 1.67591C7.67995 2.10868 7.92308 2.69565 7.92308 3.30769V4.07692M1.38462 4.07692C1.28261 4.07692 1.18478 4.11745 1.11265 4.18957C1.04052 4.2617 1 4.35953 1 4.46154V9.65385C1 10.3808 1.61923 11 2.34615 11H8.88462C9.61154 11 10.2308 10.4108 10.2308 9.68389V4.46154C10.2308 4.35953 10.1902 4.2617 10.1181 4.18957C10.046 4.11745 9.94816 4.07692 9.84615 4.07692H1.38462Z" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
</svg>
</a></li>
        </ul>
      </div>
        <div className='box'>
          <a>นำสมาร์ทโฟนของคุณมาแลก เพื่อรับเครดิตมูลค่าสูงสุด ฿17,100 สำหรับใช้ซื้อเครื่องใหม่* </a><span><a href='#'>ดูเพิ่มเติม &rsaquo;</a></span>
        </div>
    </div>

  )
}

export default Header